#    -*- mode: org -*-


Archived entries from file /home/amatyasko/research/cpgd/cifar10/results_cifar10.org


* Old results
  :PROPERTIES:
  :ARCHIVE_TIME: 2020-05-14 Thu 11:09
  :ARCHIVE_FILE: ~/research/cpgd/cifar10/results_cifar10.org
  :ARCHIVE_OLPATH: Our attack
  :ARCHIVE_CATEGORY: results_cifar10
  :END:
** L1
*** Plain
#+BEGIN_SRC python :results value :return df
  import numpy as np

  from lib.parse_logs import parse_test_optimizer_l1_log, org_group_and_summarize, org_table

  df = parse_test_optimizer_l1_log('./results/cifar10/test_l1_plain',
                                   exclude=['nll_loss', 'conf'])
  if len(df) > 0:
      df = df.sort_values('l1_corr', ascending=True)
      thresholds = [2, 4, 6, 8, 10]
      for col in df.columns:
          if col.startswith('acc_l1_') and col not in [
                  'acc_l1_%.2f' % th for th in thresholds
          ]:
              df = df.drop(columns=[col])
      df = org_table(df)
#+END_SRC

#+RESULTS:
|---------------------------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+--------------+----------+----------|
| name                                                                |   acc | acc_l1 |  conf_l2 | acc_l1_2.00 | acc_l1_4.00 | acc_l1_6.00 | acc_l1_8.00 | acc_l1_10.00 |       l1 |  l1_corr |
|---------------------------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+--------------+----------+----------|
| cifar10_plain_100k_zeros_min10_max100_c1_tol1e-2_steng-gpu_0        | 0.894 |    0.0 | 0.557904 |       0.528 |       0.209 |       0.064 |       0.014 |        0.005 | 2.496505 | 2.792512 |
| cifar10_plain_100k_normal_min10_max100_c1_tol1e-2_steng-gpu_0       | 0.894 |    0.0 | 0.558227 |       0.528 |        0.21 |       0.064 |       0.014 |        0.006 |  2.49967 | 2.796052 |
| cifar10_plain_100k_zeros_min10_max100_c10_tol5e-3_infinitus-gpu_0   | 0.894 |    0.0 | 0.559871 |       0.533 |       0.211 |       0.064 |       0.015 |        0.006 | 2.509731 | 2.807305 |
| cifar10_plain_100k_normal_min10_max100_c10_tol5e-3_infinitus-gpu_0  | 0.894 |    0.0 | 0.558449 |       0.536 |       0.214 |       0.064 |       0.014 |        0.006 | 2.514431 | 2.812563 |
| cifar10_plain_100k_normal_min10_max100_c1_tol5e-3_steng-gpu_0       | 0.894 |    0.0 | 0.559348 |       0.534 |       0.212 |       0.065 |       0.015 |        0.006 | 2.517505 | 2.816001 |
| cifar10_plain_100k_zeros_min10_max100_c100_tol5e-3_infinitus-gpu_0  | 0.894 |    0.0 | 0.556516 |       0.538 |       0.214 |       0.064 |       0.014 |        0.006 | 2.518536 | 2.817154 |
| cifar10_plain_100k_zeros_min10_max100_c1_tol5e-3_steng-gpu_0        | 0.894 |    0.0 |  0.56022 |       0.536 |       0.211 |       0.065 |       0.015 |        0.006 | 2.524347 | 2.823655 |
| cifar10_plain_100k_normal_min10_max100_c100_tol5e-3_infinitus-gpu_0 | 0.894 |    0.0 | 0.557927 |       0.532 |       0.213 |       0.064 |       0.013 |        0.006 | 2.525108 | 2.824505 |
| cifar10_plain_100k_zeros_min10_max100_c1_tol3.9e-3_infinitus-gpu_0  | 0.894 |    0.0 | 0.558998 |       0.553 |       0.222 |       0.066 |       0.015 |        0.005 | 2.589896 | 2.896975 |
| cifar10_plain_100k_normal_min10_max100_c1_tol3.9e-3_infinitus-gpu_0 | 0.894 |    0.0 | 0.559959 |       0.552 |       0.223 |        0.07 |       0.015 |        0.006 | 2.595083 | 2.902777 |
| cifar10_plain_10k_zeros_min10_max100_c10_tol5e-3_infinitus-gpu_0    | 0.894 |    0.0 | 0.567196 |       0.551 |       0.223 |       0.072 |       0.016 |        0.006 |  2.59849 | 2.906588 |
| cifar10_plain_10k_normal_min10_max100_c1_tol1e-2_steng-gpu_0        | 0.894 |    0.0 | 0.567787 |       0.544 |       0.232 |        0.07 |       0.016 |        0.006 | 2.601901 | 2.910404 |
| cifar10_plain_10k_zeros_min10_max100_c1_tol1e-2_steng-gpu_0         | 0.894 |    0.0 |  0.56919 |       0.546 |       0.233 |       0.076 |       0.018 |        0.006 | 2.603008 | 2.911642 |
| cifar10_plain_10k_normal_min10_max100_c10_tol5e-3_infinitus-gpu_0   | 0.894 |    0.0 | 0.568218 |       0.546 |       0.231 |       0.072 |       0.018 |        0.006 | 2.606505 | 2.915554 |
| cifar10_plain_10k_zeros_min10_max100_c100_tol5e-3_infinitus-gpu_0   | 0.894 |    0.0 | 0.565762 |       0.552 |       0.228 |        0.07 |       0.015 |        0.006 | 2.611103 | 2.920696 |
| cifar10_plain_10k_zeros_min10_max100_c1_tol5e-3_steng-gpu_0         | 0.894 |    0.0 | 0.568913 |       0.549 |       0.228 |       0.074 |       0.017 |        0.006 | 2.612788 | 2.922582 |
| cifar10_plain_10k_normal_min10_max100_c1_tol5e-3_steng-gpu_0        | 0.894 |    0.0 | 0.565418 |        0.55 |       0.233 |       0.073 |       0.018 |        0.006 |  2.61464 | 2.924653 |
| cifar10_plain_10k_normal_min10_max100_c100_tol5e-3_infinitus-gpu_0  | 0.894 |    0.0 | 0.566521 |       0.551 |       0.228 |       0.075 |       0.016 |        0.006 | 2.616954 | 2.927242 |
| cifar10_plain_10k_zeros_min10_max100_c1_tol3.9e-3_infinitus-gpu_0   | 0.894 |    0.0 | 0.565542 |       0.564 |       0.239 |        0.08 |       0.019 |        0.006 |  2.69044 | 3.009441 |
| cifar10_plain_10k_normal_min10_max100_c1_tol3.9e-3_infinitus-gpu_0  | 0.894 |    0.0 |  0.56856 |       0.563 |       0.243 |       0.082 |       0.019 |        0.006 | 2.702588 | 3.023029 |
| cifar10_plain_1k_zeros_min10_max100_c10_tol5e-3_infinitus-gpu_0     | 0.894 |    0.0 | 0.575973 |       0.572 |        0.26 |       0.086 |       0.023 |        0.007 | 2.736855 | 3.061359 |
| cifar10_plain_1k_zeros_min10_max100_c1_tol5e-3_steng-gpu_0          | 0.894 |    0.0 | 0.579711 |       0.574 |       0.246 |       0.084 |       0.021 |        0.007 | 2.754455 | 3.081046 |
| cifar10_plain_1k_normal_min10_max100_c1_tol5e-3_steng-gpu_0         | 0.894 |    0.0 |  0.57682 |       0.573 |       0.262 |       0.086 |       0.024 |        0.007 | 2.758035 |  3.08505 |
| cifar10_plain_1k_zeros_min10_max100_c1_tol1e-2_steng-gpu_0          | 0.894 |    0.0 | 0.581273 |       0.573 |       0.262 |       0.087 |       0.023 |        0.006 | 2.762475 | 3.090017 |
| cifar10_plain_1k_normal_min10_max100_c10_tol5e-3_infinitus-gpu_0    | 0.894 |    0.0 | 0.577158 |        0.57 |        0.27 |       0.091 |       0.023 |        0.007 | 2.765924 | 3.093874 |
| cifar10_plain_1k_normal_min10_max100_c1_tol1e-2_steng-gpu_0         | 0.894 |    0.0 | 0.582119 |       0.577 |       0.253 |       0.089 |       0.024 |        0.007 | 2.776085 |  3.10524 |
| cifar10_plain_1k_zeros_min10_max100_c1_tol3.9e-3_infinitus-gpu_0    | 0.894 |    0.0 |  0.57723 |       0.582 |       0.266 |       0.087 |       0.027 |        0.007 | 2.815741 | 3.149598 |
| cifar10_plain_1k_normal_min10_max100_c1_tol3.9e-3_infinitus-gpu_0   | 0.894 |    0.0 | 0.577792 |       0.587 |       0.274 |       0.093 |       0.025 |        0.008 | 2.842417 | 3.179438 |
| cifar10_plain_1k_zeros_min10_max100_c100_tol5e-3_infinitus-gpu_0    | 0.894 |    0.0 | 0.581643 |       0.671 |       0.347 |       0.143 |       0.048 |        0.018 | 3.315459 | 3.708567 |
| cifar10_plain_1k_normal_min10_max100_c100_tol5e-3_infinitus-gpu_0   | 0.894 |    0.0 | 0.578963 |       0.677 |        0.37 |       0.135 |       0.042 |        0.012 |  3.35475 | 3.752517 |
| cifar10_plain_100k_normal_min10_max100_c1_tol1e-3_steng-gpu_0       | 0.894 |    0.0 | 0.613608 |       0.894 |        0.87 |       0.756 |       0.394 |        0.144 | 7.094664 | 7.935866 |
| cifar10_plain_100k_zeros_min10_max100_c1_tol1e-3_steng-gpu_0        | 0.894 |    0.0 | 0.611805 |       0.894 |       0.873 |       0.769 |        0.39 |        0.142 | 7.096721 | 7.938167 |
| cifar10_plain_10k_normal_min10_max100_c1_tol1e-3_steng-gpu_0        | 0.894 |    0.0 | 0.629066 |       0.894 |       0.877 |       0.769 |       0.405 |        0.161 | 7.221033 | 8.077218 |
| cifar10_plain_10k_zeros_min10_max100_c1_tol1e-3_steng-gpu_0         | 0.894 |    0.0 | 0.625407 |       0.894 |       0.875 |       0.781 |       0.405 |        0.163 | 7.231117 | 8.088498 |
| cifar10_plain_1k_zeros_min10_max100_c1_tol1e-3_steng-gpu_0          | 0.894 |    0.0 | 0.649076 |       0.894 |        0.88 |       0.789 |       0.419 |        0.174 | 7.318168 | 8.185869 |
| cifar10_plain_1k_normal_min10_max100_c1_tol1e-3_steng-gpu_0         | 0.894 |    0.0 | 0.644321 |       0.894 |        0.88 |       0.782 |       0.421 |        0.185 | 7.344694 | 8.215542 |
|---------------------------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+--------------+----------+----------|

|----------------------------------------------+----------+-------+---------+--------+----------+-------------+-------------+-------------+-------------+--------------+----------+----------|
| name                                         | nll_loss |   acc |    conf | acc_l1 |  conf_l1 | acc_l1_2.00 | acc_l1_4.00 | acc_l1_6.00 | acc_l1_8.00 | acc_l1_10.00 |       l1 |  l1_corr |
|----------------------------------------------+----------+-------+---------+--------+----------+-------------+-------------+-------------+-------------+--------------+----------+----------|
| cifar10_plain_100k_zeros_min10_max100_c10_0  | 0.986218 | 0.894 | 0.96802 |    0.0 | 0.559081 |       0.533 |       0.209 |       0.065 |       0.014 |        0.006 | 2.507072 | 2.804332 |
| cifar10_plain_100k_normal_min10_max100_c10_0 | 0.986218 | 0.894 | 0.96802 |    0.0 | 0.559759 |       0.537 |       0.212 |       0.066 |       0.015 |        0.006 | 2.514471 | 2.812607 |
| cifar10_plain_100k_zeros_min10_max100_0      | 0.986218 | 0.894 | 0.96802 |    0.0 | 0.557824 |       0.532 |       0.209 |       0.064 |       0.015 |        0.006 | 2.516497 | 2.814873 |
| cifar10_plain_10k_zeros_min10_max100_c10_0   | 0.986218 | 0.894 | 0.96802 |    0.0 | 0.567616 |       0.549 |       0.228 |       0.073 |       0.016 |        0.006 | 2.601036 | 2.909436 |
| cifar10_plain_10k_normal_min10_max100_c10_0  | 0.986218 | 0.894 | 0.96802 |    0.0 | 0.567952 |       0.551 |       0.228 |       0.073 |        0.02 |        0.006 | 2.603428 | 2.912112 |
| cifar10_plain_10k_zeros_min10_max100_0       | 0.986218 | 0.894 | 0.96802 |    0.0 | 0.565234 |        0.55 |       0.231 |       0.075 |       0.016 |        0.006 | 2.611093 | 2.920686 |
| cifar10_plain_10k_normal_min10_max100_0      | 0.986218 | 0.894 | 0.96802 |    0.0 | 0.566654 |       0.553 |        0.23 |       0.071 |       0.016 |        0.005 | 2.618411 | 2.928871 |
| cifar10_plain_1k_zeros_min10_max100_c10_0    | 0.986218 | 0.894 | 0.96802 |    0.0 | 0.579383 |       0.571 |        0.26 |       0.091 |       0.025 |        0.008 | 2.768108 | 3.096318 |
| cifar10_plain_1k_normal_min10_max100_c10_0   | 0.986218 | 0.894 | 0.96802 |    0.0 | 0.576317 |       0.571 |       0.264 |        0.09 |       0.026 |        0.007 | 2.771025 | 3.099581 |
| cifar10_plain_1k_zeros_min10_max100_0        | 0.986218 | 0.894 | 0.96802 |    0.0 | 0.580204 |        0.67 |       0.345 |       0.134 |       0.048 |        0.014 | 3.289966 | 3.680052 |
| cifar10_plain_1k_normal_min10_max100_0       | 0.986218 | 0.894 | 0.96802 |    0.0 | 0.581259 |       0.679 |       0.364 |       0.141 |       0.047 |        0.014 | 3.367019 | 3.766241 |
|----------------------------------------------+----------+-------+---------+--------+----------+-------------+-------------+-------------+-------------+--------------+----------+----------|

*** L-inf
#+BEGIN_SRC python :results value :return df
  import numpy as np

  from lib.parse_logs import parse_test_optimizer_l1_log, org_group_and_summarize, org_table

  df = parse_test_optimizer_l1_log('./results/cifar10/test_l1_linf')
  if len(df) > 0:
      df = df.sort_values('l1_corr', ascending=True)
      thresholds = [5, 8.75, 12.5, 16.25, 20]
      for col in df.columns:
          if col.startswith('acc_l1_') and col not in ['acc_l1_%.2f' % th for th in thresholds]:
              df = df.drop(columns=[col])
      df = org_table(df)
#+END_SRC

#+RESULTS:
|--------------------------------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+--------------+--------------+--------------+----------+-----------|
| name                                                               | nll_loss |   acc |     conf | acc_l1 |  conf_l2 | acc_l1_5.00 | acc_l1_8.75 | acc_l1_12.50 | acc_l1_16.25 | acc_l1_20.00 |       l1 |   l1_corr |
|--------------------------------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+--------------+--------------+--------------+----------+-----------|
| cifar10_linf_100k_zeros_min10_max100_c100_tol5e-3_infinitus-gpu_0  | 1.586139 | 0.804 | 0.975138 |    0.0 | 0.587436 |       0.331 |       0.142 |        0.056 |         0.02 |        0.003 | 4.158229 |  5.171926 |
| cifar10_linf_100k_normal_min10_max100_c100_tol5e-3_infinitus-gpu_0 | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.587241 |       0.329 |       0.143 |        0.058 |         0.02 |        0.002 | 4.163188 |  5.178095 |
| cifar10_linf_100k_normal_min10_max100_c1_tol1e-2_steng-gpu_0       | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.588482 |       0.327 |       0.142 |        0.057 |         0.02 |        0.003 | 4.163398 |  5.178356 |
| cifar10_linf_100k_normal_min10_max100_c10_tol5e-3_infinitus-gpu_0  | 1.586139 | 0.804 | 0.975138 |    0.0 | 0.587927 |       0.328 |       0.146 |        0.056 |        0.019 |        0.003 | 4.170213 |  5.186832 |
| cifar10_linf_100k_zeros_min10_max100_c1_tol5e-3_steng-gpu_0        | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.588072 |       0.329 |       0.145 |        0.057 |        0.018 |        0.003 | 4.170448 |  5.187124 |
| cifar10_linf_100k_zeros_min10_max100_c1_tol1e-2_steng-gpu_0        | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.587795 |       0.329 |       0.146 |        0.055 |        0.018 |        0.003 | 4.174234 |  5.191833 |
| cifar10_linf_100k_normal_min10_max100_c1_tol5e-3_steng-gpu_0       | 1.586139 | 0.804 | 0.975138 |    0.0 |  0.58787 |        0.33 |       0.146 |        0.052 |        0.021 |        0.002 | 4.177831 |  5.196307 |
| cifar10_linf_100k_zeros_min10_max100_c10_tol5e-3_infinitus-gpu_0   | 1.586139 | 0.804 | 0.975138 |    0.0 |  0.58775 |       0.331 |       0.147 |        0.056 |        0.019 |        0.004 | 4.184379 |  5.204451 |
| cifar10_linf_100k_zeros_min10_max100_c1_tol3.9e-3_infinitus-gpu_0  | 1.586139 | 0.804 | 0.975138 |    0.0 | 0.589373 |       0.333 |        0.15 |        0.056 |        0.018 |        0.003 |  4.22506 |   5.25505 |
| cifar10_linf_100k_normal_min10_max100_c1_tol3.9e-3_infinitus-gpu_0 | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.590404 |       0.335 |       0.149 |        0.057 |        0.019 |        0.003 | 4.230921 |   5.26234 |
| cifar10_linf_10k_zeros_min10_max100_c100_tol5e-3_infinitus-gpu_0   | 1.586139 | 0.804 | 0.975138 |    0.0 | 0.591271 |       0.346 |       0.157 |         0.06 |        0.023 |        0.007 | 4.329201 |  5.384579 |
| cifar10_linf_10k_normal_min10_max100_c10_tol5e-3_infinitus-gpu_0   | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.591974 |       0.344 |       0.155 |        0.062 |        0.021 |        0.004 |  4.33254 |  5.388731 |
| cifar10_linf_10k_normal_min10_max100_c1_tol5e-3_steng-gpu_0        | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.590956 |       0.346 |       0.155 |        0.061 |        0.023 |        0.005 | 4.337943 |  5.395452 |
| cifar10_linf_10k_zeros_min10_max100_c1_tol1e-2_steng-gpu_0         | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.591853 |       0.337 |       0.154 |        0.062 |        0.023 |        0.004 | 4.338738 |  5.396441 |
| cifar10_linf_10k_zeros_min10_max100_c10_tol5e-3_infinitus-gpu_0    | 1.586139 | 0.804 | 0.975138 |    0.0 | 0.591554 |       0.346 |       0.162 |        0.061 |        0.021 |        0.005 | 4.340805 |  5.399012 |
| cifar10_linf_10k_normal_min10_max100_c1_tol1e-2_steng-gpu_0        | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.591039 |       0.348 |       0.156 |         0.06 |        0.022 |        0.005 | 4.342813 |  5.401509 |
| cifar10_linf_10k_zeros_min10_max100_c1_tol5e-3_steng-gpu_0         | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.591559 |       0.348 |        0.16 |        0.063 |        0.019 |        0.004 | 4.349982 |  5.410426 |
| cifar10_linf_10k_normal_min10_max100_c100_tol5e-3_infinitus-gpu_0  | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.591523 |       0.343 |       0.155 |        0.061 |        0.024 |        0.006 | 4.364141 |  5.428036 |
| cifar10_linf_10k_normal_min10_max100_c1_tol3.9e-3_infinitus-gpu_0  | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.593104 |       0.353 |       0.161 |         0.06 |        0.021 |        0.003 | 4.399573 |  5.472106 |
| cifar10_linf_10k_zeros_min10_max100_c1_tol3.9e-3_infinitus-gpu_0   | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.593462 |       0.353 |       0.166 |        0.061 |        0.022 |        0.003 | 4.412166 |  5.487769 |
| cifar10_linf_1k_normal_min10_max100_c10_tol5e-3_infinitus-gpu_0    | 1.586139 | 0.804 | 0.975138 |    0.0 | 0.596123 |       0.372 |       0.187 |        0.079 |        0.031 |        0.009 |  4.70956 |  5.857662 |
| cifar10_linf_1k_normal_min10_max100_c1_tol1e-2_steng-gpu_0         | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.598131 |       0.373 |       0.193 |        0.077 |        0.029 |        0.009 | 4.711714 |  5.860341 |
| cifar10_linf_1k_normal_min10_max100_c1_tol5e-3_steng-gpu_0         | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.597622 |        0.38 |       0.189 |         0.08 |        0.035 |        0.012 | 4.753375 |  5.912157 |
| cifar10_linf_1k_zeros_min10_max100_c1_tol1e-2_steng-gpu_0          | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.597606 |       0.378 |       0.197 |        0.075 |        0.033 |         0.01 | 4.761152 |  5.921831 |
| cifar10_linf_1k_zeros_min10_max100_c1_tol5e-3_steng-gpu_0          | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.598191 |       0.379 |       0.193 |        0.075 |        0.032 |         0.01 | 4.765176 |  5.926836 |
| cifar10_linf_1k_zeros_min10_max100_c10_tol5e-3_infinitus-gpu_0     | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.597183 |        0.38 |       0.192 |        0.083 |        0.033 |        0.009 | 4.765954 |  5.927804 |
| cifar10_linf_1k_normal_min10_max100_c1_tol3.9e-3_infinitus-gpu_0   | 1.586139 | 0.804 | 0.975138 |    0.0 | 0.597594 |        0.38 |        0.19 |        0.079 |        0.033 |        0.012 | 4.801405 |  5.971897 |
| cifar10_linf_1k_zeros_min10_max100_c1_tol3.9e-3_infinitus-gpu_0    | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.597464 |       0.389 |       0.198 |        0.078 |        0.029 |        0.011 | 4.835018 |  6.013703 |
| cifar10_linf_1k_normal_min10_max100_c100_tol5e-3_infinitus-gpu_0   | 1.586139 | 0.804 | 0.975138 |    0.0 | 0.594551 |       0.404 |       0.205 |        0.109 |        0.048 |        0.025 | 5.279621 |  6.566692 |
| cifar10_linf_1k_zeros_min10_max100_c100_tol5e-3_infinitus-gpu_0    | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.596044 |       0.402 |       0.221 |        0.103 |        0.051 |        0.022 | 5.299309 |   6.59118 |
| cifar10_linf_100k_zeros_min10_max100_c1_tol1e-3_steng-gpu_0        | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.642939 |       0.741 |       0.404 |        0.184 |        0.069 |        0.031 | 7.873761 |  9.793234 |
| cifar10_linf_100k_normal_min10_max100_c1_tol1e-3_steng-gpu_0       | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.644585 |       0.741 |       0.401 |        0.183 |        0.072 |        0.028 | 7.874724 |  9.794434 |
| cifar10_linf_10k_normal_min10_max100_c1_tol1e-3_steng-gpu_0        | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.643192 |       0.752 |       0.428 |        0.206 |        0.082 |        0.032 | 8.125774 | 10.106684 |
| cifar10_linf_10k_zeros_min10_max100_c1_tol1e-3_steng-gpu_0         | 1.586138 | 0.804 | 0.975138 |    0.0 |  0.64318 |       0.755 |       0.427 |        0.207 |        0.081 |        0.034 | 8.149641 | 10.136369 |
| cifar10_linf_1k_normal_min10_max100_c1_tol1e-3_steng-gpu_0         | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.647349 |       0.768 |       0.463 |        0.244 |        0.103 |        0.046 | 8.617137 | 10.717832 |
| cifar10_linf_1k_zeros_min10_max100_c1_tol1e-3_steng-gpu_0          | 1.586138 | 0.804 | 0.975138 |    0.0 | 0.640278 |       0.761 |       0.459 |        0.239 |        0.113 |        0.048 | 8.691741 | 10.810625 |
|--------------------------------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+--------------+--------------+--------------+----------+-----------|

*** L-2
#+BEGIN_SRC python :results value :return df
  import numpy as np

  from lib.parse_logs import parse_test_optimizer_l1_log, org_group_and_summarize, org_table

  df = parse_test_optimizer_l1_log('./results/cifar10/test_l1_l2')
  if len(df) > 0:
      df = df.sort_values('l1_corr', ascending=True)
      thresholds = [3, 6, 9, 12, 15]
      for col in df.columns:
          if col.startswith('acc_l1_') and col not in ['acc_l1_%.2f' % th for th in thresholds]:
              df = df.drop(columns=[col])
      df = org_table(df)
#+END_SRC

#+RESULTS:
|------------------------------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+-------------+--------------+--------------+-----------+-----------|
| name                                                             | nll_loss |   acc |     conf | acc_l1 |  conf_l2 | acc_l1_3.00 | acc_l1_6.00 | acc_l1_9.00 | acc_l1_12.00 | acc_l1_15.00 |        l1 |   l1_corr |
|------------------------------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+-------------+--------------+--------------+-----------+-----------|
| cifar10_l2_100k_zeros_min10_max100_c100_tol5e-3_infinitus-gpu_0  | 1.539492 | 0.807 | 0.973637 |    0.0 | 0.588362 |       0.627 |       0.425 |       0.255 |        0.144 |        0.082 |  5.989446 |  7.421866 |
| cifar10_l2_100k_normal_min10_max100_c10_tol5e-3_infinitus-gpu_0  | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.588841 |       0.627 |       0.426 |       0.252 |        0.145 |         0.08 |  5.989472 |  7.421898 |
| cifar10_l2_100k_normal_min10_max100_c1_tol1e-2_steng-gpu_0       | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.587725 |       0.627 |       0.429 |       0.255 |        0.147 |        0.083 |  5.994511 |  7.428141 |
| cifar10_l2_100k_normal_min10_max100_c100_tol5e-3_infinitus-gpu_0 | 1.539492 | 0.807 | 0.973637 |    0.0 | 0.588975 |       0.629 |       0.427 |       0.254 |        0.148 |        0.078 |   6.00457 |  7.440607 |
| cifar10_l2_100k_zeros_min10_max100_c10_tol5e-3_infinitus-gpu_0   | 1.539492 | 0.807 | 0.973637 |    0.0 | 0.588408 |       0.629 |       0.426 |       0.256 |        0.145 |        0.082 |  6.005792 |  7.442122 |
| cifar10_l2_100k_zeros_min10_max100_c1_tol5e-3_steng-gpu_0        | 1.539493 | 0.807 | 0.973637 |    0.0 |  0.58886 |       0.629 |       0.425 |       0.253 |        0.146 |        0.083 |  6.013398 |  7.451546 |
| cifar10_l2_100k_normal_min10_max100_c1_tol5e-3_steng-gpu_0       | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.588866 |       0.629 |        0.43 |       0.252 |        0.148 |        0.086 |  6.013869 |   7.45213 |
| cifar10_l2_100k_normal_min10_max100_c1_tol3.9e-3_infinitus-gpu_0 | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.589685 |       0.631 |       0.433 |       0.257 |        0.149 |        0.085 |  6.084424 |  7.539558 |
| cifar10_l2_10k_normal_min10_max100_c1_tol1e-2_steng-gpu_0        | 1.539492 | 0.807 | 0.973637 |    0.0 |  0.59393 |       0.631 |       0.437 |       0.265 |        0.161 |        0.088 |  6.210863 |  7.696237 |
| cifar10_l2_10k_zeros_min10_max100_c10_tol5e-3_infinitus-gpu_0    | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.593507 |       0.633 |       0.443 |       0.267 |        0.159 |         0.09 |  6.218885 |  7.706178 |
| cifar10_l2_10k_normal_min10_max100_c100_tol5e-3_infinitus-gpu_0  | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.593604 |       0.635 |       0.444 |       0.259 |        0.161 |         0.09 |  6.221211 |  7.709059 |
| cifar10_l2_10k_normal_min10_max100_c10_tol5e-3_infinitus-gpu_0   | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.592217 |       0.634 |       0.442 |       0.269 |        0.162 |        0.089 |   6.22139 |  7.709281 |
| cifar10_l2_10k_zeros_min10_max100_c1_tol1e-2_steng-gpu_0         | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.594236 |       0.633 |       0.437 |       0.271 |        0.162 |        0.088 |  6.224001 |  7.712517 |
| cifar10_l2_10k_zeros_min10_max100_c1_tol5e-3_steng-gpu_0         | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.594024 |       0.634 |       0.444 |       0.264 |        0.158 |        0.093 |  6.238078 |   7.72996 |
| cifar10_l2_10k_zeros_min10_max100_c100_tol5e-3_infinitus-gpu_0   | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.593652 |       0.634 |       0.439 |       0.269 |        0.164 |        0.092 |  6.248112 |  7.742394 |
| cifar10_l2_10k_normal_min10_max100_c1_tol5e-3_steng-gpu_0        | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.593048 |       0.633 |        0.44 |       0.268 |        0.164 |        0.093 |  6.253069 |  7.748537 |
| cifar10_l2_10k_normal_min10_max100_c1_tol3.9e-3_infinitus-gpu_0  | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.595606 |       0.638 |       0.449 |        0.27 |         0.16 |        0.095 |  6.335266 |  7.850391 |
| cifar10_l2_10k_zeros_min10_max100_c1_tol3.9e-3_infinitus-gpu_0   | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.595192 |       0.639 |       0.449 |       0.274 |        0.169 |        0.095 |  6.357407 |  7.877828 |
| cifar10_l2_1k_zeros_min10_max100_c1_tol1e-2_steng-gpu_0          | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.600655 |       0.645 |       0.461 |       0.291 |        0.182 |        0.111 |  6.647879 |  8.237767 |
| cifar10_l2_1k_normal_min10_max100_c1_tol1e-2_steng-gpu_0         | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.600935 |       0.645 |       0.462 |       0.292 |        0.181 |        0.108 |  6.647989 |  8.237904 |
| cifar10_l2_1k_zeros_min10_max100_c10_tol5e-3_infinitus-gpu_0     | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.599301 |       0.643 |       0.467 |       0.297 |        0.186 |        0.111 |  6.685547 |  8.284446 |
| cifar10_l2_1k_zeros_min10_max100_c1_tol5e-3_steng-gpu_0          | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.602874 |       0.644 |       0.469 |       0.304 |        0.186 |        0.114 |  6.688966 |  8.288681 |
| cifar10_l2_1k_normal_min10_max100_c1_tol5e-3_steng-gpu_0         | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.600973 |       0.651 |       0.471 |       0.298 |        0.187 |         0.12 |  6.723731 |   8.33176 |
| cifar10_l2_1k_normal_min10_max100_c10_tol5e-3_infinitus-gpu_0    | 1.539492 | 0.807 | 0.973637 |    0.0 | 0.599933 |       0.644 |        0.47 |       0.299 |        0.191 |        0.115 |  6.740236 |  8.352213 |
| cifar10_l2_1k_zeros_min10_max100_c1_tol3.9e-3_infinitus-gpu_0    | 1.539492 | 0.807 | 0.973637 |    0.0 | 0.602737 |       0.654 |       0.477 |       0.304 |        0.189 |        0.114 |  6.774509 |  8.394684 |
| cifar10_l2_1k_normal_min10_max100_c1_tol3.9e-3_infinitus-gpu_0   | 1.539492 | 0.807 | 0.973637 |    0.0 | 0.600156 |       0.654 |        0.47 |       0.305 |         0.19 |        0.113 |  6.796975 |  8.422522 |
| cifar10_l2_1k_zeros_min10_max100_c100_tol5e-3_infinitus-gpu_0    | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.597689 |       0.672 |       0.493 |       0.327 |        0.219 |        0.136 |  7.249588 |   8.98338 |
| cifar10_l2_1k_normal_min10_max100_c100_tol5e-3_infinitus-gpu_0   | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.595898 |       0.677 |         0.5 |       0.329 |        0.218 |        0.137 |  7.351001 |  9.109047 |
| cifar10_l2_100k_normal_min10_max100_c1_tol1e-3_steng-gpu_0       | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.620714 |       0.807 |       0.768 |       0.574 |        0.385 |        0.228 | 10.213284 | 12.655867 |
| cifar10_l2_10k_zeros_min10_max100_c1_tol1e-3_steng-gpu_0         | 1.539493 | 0.807 | 0.973637 |    0.0 |  0.63487 |       0.806 |       0.781 |       0.591 |        0.412 |        0.245 | 10.564919 | 13.091599 |
| cifar10_l2_10k_normal_min10_max100_c1_tol1e-3_steng-gpu_0        | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.630897 |       0.807 |       0.771 |       0.591 |        0.406 |         0.25 | 10.593135 | 13.126561 |
| cifar10_l2_1k_normal_min10_max100_c1_tol1e-3_steng-gpu_0         | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.641199 |       0.807 |       0.779 |       0.607 |        0.437 |        0.276 | 11.070057 | 13.717543 |
| cifar10_l2_1k_zeros_min10_max100_c1_tol1e-3_steng-gpu_0          | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.639098 |       0.807 |       0.784 |       0.609 |        0.439 |        0.276 | 11.079655 | 13.729434 |
|------------------------------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+-------------+--------------+--------------+-----------+-----------|

|-------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+-------------+--------------+--------------+----------+----------|
| name                                      | nll_loss |   acc |     conf | acc_l1 |  conf_l1 | acc_l1_3.00 | acc_l1_6.00 | acc_l1_9.00 | acc_l1_12.00 | acc_l1_15.00 |       l1 |  l1_corr |
|-------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+-------------+--------------+--------------+----------+----------|
| cifar10_l2_100k_zeros_min10_max100_c10_0  | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.589365 |        0.63 |       0.421 |       0.251 |        0.149 |        0.081 | 5.993164 | 7.426474 |
| cifar10_l2_100k_normal_min10_max100_c10_0 | 1.539492 | 0.807 | 0.973637 |    0.0 | 0.587929 |       0.628 |       0.425 |       0.252 |        0.146 |        0.083 | 5.993952 | 7.427449 |
| cifar10_linf_100k_zeros_min10_max100_0    | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.589398 |       0.628 |       0.424 |       0.254 |        0.146 |         0.08 | 5.999459 | 7.434275 |
| cifar10_linf_10k_normal_min10_max100_0    | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.593449 |       0.636 |       0.443 |       0.264 |        0.161 |        0.088 | 6.222314 | 7.710427 |
| cifar10_l2_10k_normal_min10_max100_c10_0  | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.593879 |       0.636 |       0.445 |       0.267 |        0.162 |        0.089 | 6.228924 | 7.718617 |
| cifar10_l2_10k_zeros_min10_max100_c10_0   | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.594251 |       0.635 |       0.444 |       0.267 |        0.158 |        0.091 | 6.229979 | 7.719925 |
| cifar10_linf_10k_zeros_min10_max100_0     | 1.539492 | 0.807 | 0.973637 |    0.0 | 0.593216 |       0.633 |       0.444 |       0.265 |        0.162 |         0.09 | 6.237856 | 7.729685 |
| cifar10_l2_1k_zeros_min10_max100_c10_0    | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.599375 |        0.64 |       0.466 |       0.296 |        0.188 |        0.117 | 6.697077 | 8.298733 |
| cifar10_l2_1k_normal_min10_max100_c10_0   | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.599301 |       0.644 |       0.471 |       0.295 |        0.189 |        0.113 | 6.720698 | 8.328002 |
| cifar10_linf_1k_zeros_min10_max100_0      | 1.539493 | 0.807 | 0.973637 |    0.0 | 0.598177 |       0.674 |       0.488 |        0.33 |        0.218 |        0.142 | 7.277662 | 9.018168 |
| cifar10_linf_1k_normal_min10_max100_0     | 1.539493 | 0.807 | 0.973637 |    0.0 |  0.59651 |       0.675 |       0.493 |       0.337 |        0.217 |        0.131 | 7.326252 |  9.07838 |
|-------------------------------------------+----------+-------+----------+--------+----------+-------------+-------------+-------------+--------------+--------------+----------+----------|

* JSMA attack
** Plain
|-----------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+--------------+------------+-----------+------------|
| name                                                |   acc | acc_l0 |  conf_l0 | acc_l0_1.00 | acc_l0_3.00 | acc_l0_5.00 | acc_l0_8.00 | acc_l0_12.00 |         l0 |    l0_all |    l0_corr |
|-----------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+--------------+------------+-----------+------------|
| cifar10_jsma_plain_all_t1.0_g1.0_libart_0           | 0.894 |    0.0 | 0.757858 |       0.886 |       0.826 |       0.757 |       0.652 |        0.533 |  16.419001 |    19.034 |  18.365772 |
| cifar10_jsma_plain_all_t0.1_g1.0_libart_0           | 0.894 |    0.0 | 0.626475 |       0.888 |       0.855 |       0.824 |       0.762 |        0.682 |      27.26 | 34.497002 |   30.49217 |
| cifar10_jsma_plain_second_t1.0_g1.0_libart_0        | 0.894 |    0.0 | 0.731758 |       0.887 |        0.84 |       0.791 |       0.721 |        0.649 |     29.931 | 36.374001 |  33.479866 |
| cifar10_jsma_plain_random_t1.0_g1.0_libart_0        | 0.894 |    0.0 | 0.693855 |       0.978 |       0.963 |       0.946 |       0.909 |        0.853 |  38.078999 | 44.616001 |  39.761745 |
| cifar10_jsma_plain_second_t0.1_g1.0_libart_0        | 0.894 |    0.0 | 0.617427 |       0.889 |       0.857 |        0.83 |       0.787 |        0.728 |     46.987 | 63.144001 |  52.558167 |
| cifar10_jsma_plain_random_t0.1_g1.0_libart_0        | 0.894 |    0.0 | 0.573614 |        0.98 |       0.969 |        0.96 |       0.941 |        0.911 |  61.688999 | 79.621002 |  64.295303 |
| cifar10_jsma_plain_random_t1.0_g1.0_libcleverhans_0 | 0.894 |    0.0 | 0.725096 |        0.98 |       0.967 |       0.954 |       0.942 |        0.905 |  72.078003 | 92.026001 |  76.147652 |
| cifar10_jsma_plain_random_pixel_0                   | 0.894 |    0.0 | 0.729946 |       0.885 |       0.862 |       0.839 |       0.812 |         0.78 |  78.403999 |       nan |  87.700226 |
| cifar10_jsma_plain_second_pixel_0                   | 0.894 |    0.0 | 0.729946 |       0.885 |       0.862 |       0.839 |       0.812 |         0.78 |  78.403999 |       nan |  87.700226 |
| cifar10_jsma_plain_random_0                         | 0.894 |    0.0 | 0.729946 |       0.894 |       0.868 |       0.848 |       0.816 |        0.784 | 111.316002 |       nan | 124.514542 |
| cifar10_jsma_plain_second_0                         | 0.894 |    0.0 | 0.729946 |       0.894 |       0.868 |       0.848 |       0.816 |        0.784 | 111.316002 |       nan | 124.514542 |
|-----------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+--------------+------------+-----------+------------|

** Linf
|----------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+--------------+-----------+-----------+-----------|
| name                                               |   acc | acc_l0 |  conf_l0 | acc_l0_1.00 | acc_l0_3.00 | acc_l0_5.00 | acc_l0_8.00 | acc_l0_12.00 |        l0 |    l0_all |   l0_corr |
|----------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+--------------+-----------+-----------+-----------|
| cifar10_jsma_linf_all_t1.0_g1.0_libart_0           | 0.804 |    0.0 | 0.808461 |       0.803 |       0.753 |       0.687 |       0.601 |        0.516 |    20.122 |     24.33 | 25.027363 |
| cifar10_jsma_linf_all_t0.1_g1.0_libart_0           | 0.804 |    0.0 | 0.658187 |       0.804 |       0.769 |       0.729 |        0.67 |        0.591 | 28.037001 | 34.589001 | 34.871891 |
| cifar10_jsma_linf_second_t1.0_g1.0_libart_0        | 0.804 |    0.0 |  0.78076 |       0.803 |       0.757 |       0.703 |       0.638 |        0.574 | 35.672001 | 44.700001 |  44.36816 |
| cifar10_jsma_linf_second_t0.1_g1.0_libart_0        | 0.804 |    0.0 | 0.645268 |       0.804 |        0.77 |       0.739 |       0.698 |        0.643 | 50.580002 |    64.903 | 62.910446 |
| cifar10_jsma_linf_random_pixel_0                   | 0.804 |  0.001 | 0.777353 |       0.804 |       0.769 |       0.727 |        0.68 |        0.629 | 53.703999 |       nan | 66.796021 |
| cifar10_jsma_linf_second_pixel_0                   | 0.804 |  0.001 | 0.777353 |       0.804 |       0.769 |       0.727 |        0.68 |        0.629 | 53.703999 |       nan | 66.796021 |
| cifar10_jsma_linf_random_t1.0_g1.0_libart_0        | 0.804 |    0.0 | 0.728151 |       0.964 |       0.948 |       0.928 |       0.896 |        0.865 | 54.964001 | 67.646004 | 61.302238 |
| cifar10_jsma_linf_random_t0.1_g1.0_libcleverhans_0 | 0.804 |    0.0 | 0.732122 |       0.965 |        0.95 |       0.929 |         0.9 |        0.864 | 60.193001 | 72.599998 | 67.057213 |
| cifar10_jsma_linf_second_0                         | 0.804 |  0.001 |   0.7777 |       0.804 |       0.777 |       0.742 |       0.688 |        0.644 |    66.763 |       nan | 83.038559 |
| cifar10_jsma_linf_random_0                         | 0.804 |  0.001 | 0.777353 |       0.804 |       0.777 |       0.742 |       0.688 |        0.644 | 67.802002 |       nan | 84.330849 |
| cifar10_jsma_linf_random_t0.1_g1.0_libart_0        | 0.804 |    0.0 | 0.572859 |       0.965 |       0.955 |       0.936 |       0.922 |        0.895 | 77.297997 | 97.928001 | 86.374374 |
|----------------------------------------------------+-------+--------+----------+-------------+-------------+-------------+-------------+--------------+-----------+-----------+-----------|

** L2
|-------------------------------------------+-------+--------+----------+-------------+-------------+-------------+--------------+--------------+-----------+-----------+------------|
| name                                      |   acc | acc_l0 |  conf_l0 | acc_l0_1.00 | acc_l0_3.00 | acc_l0_5.00 | acc_l0_10.00 | acc_l0_15.00 |        l0 |    l0_all |    l0_corr |
|-------------------------------------------+-------+--------+----------+-------------+-------------+-------------+--------------+--------------+-----------+-----------+------------|
| cifar10_jsma_l2_all_t1.0_g1.0_libart_0    | 0.807 |    0.0 | 0.777946 |       0.796 |       0.754 |       0.714 |        0.597 |        0.498 |    21.093 | 29.441999 |  26.137547 |
| cifar10_jsma_l2_all_t0.1_g1.0_libart_0    | 0.807 |    0.0 | 0.636844 |       0.802 |       0.767 |       0.739 |        0.664 |         0.59 |    30.608 | 44.811001 |  37.928127 |
| cifar10_jsma_l2_second_t1.0_g1.0_libart_0 | 0.807 |    0.0 | 0.765342 |       0.796 |       0.756 |        0.72 |        0.632 |        0.557 | 39.654999 | 57.655998 |  49.138786 |
| cifar10_jsma_l2_second_pixel_0            | 0.807 |  0.002 |  0.76255 |         0.8 |       0.771 |       0.736 |        0.668 |        0.602 | 53.623001 |       nan |  66.447334 |
| cifar10_jsma_l2_second_t0.1_g1.0_libart_0 | 0.807 |    0.0 | 0.630115 |       0.802 |       0.772 |       0.747 |        0.683 |        0.632 | 58.977001 |    90.542 |  73.081787 |
| cifar10_jsma_l2_second_0                  | 0.807 |  0.002 |  0.76255 |       0.807 |        0.78 |       0.755 |        0.695 |        0.651 | 80.880997 |       nan | 100.224289 |
|-------------------------------------------+-------+--------+----------+-------------+-------------+-------------+--------------+--------------+-----------+-----------+------------|

